; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image0 - mode
	infrared1 - mode
	Star1 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star6 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet17)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 image0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 image0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
)
(:goal (and
	(pointing satellite0 Star13)
	(have_image Planet8 infrared1)
	(have_image Star9 infrared1)
	(have_image Planet10 image0)
	(have_image Planet11 image0)
	(have_image Phenomenon12 image0)
	(have_image Star13 infrared1)
	(have_image Planet14 image0)
	(have_image Planet15 image0)
	(have_image Star16 infrared1)
	(have_image Planet17 infrared1)
))

)

; plan
1. (turn_to satellite0 groundstation0 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 11
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 11
4. (turn_to satellite0 planet14 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet14)
   goals met: 0 of 11
5. (take_image satellite0 planet14 instrument0 image0)
   added: (have_image planet14 image0)
   goals met: 1 of 11
6. (turn_to satellite0 planet11 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet11)
   goals met: 1 of 11
7. (take_image satellite0 planet11 instrument0 image0)
   added: (have_image planet11 image0)
   goals met: 2 of 11
8. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 2 of 11
9. (take_image satellite0 planet10 instrument0 image0)
   added: (have_image planet10 image0)
   goals met: 3 of 11
10. (turn_to satellite0 phenomenon12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 11
11. (take_image satellite0 phenomenon12 instrument0 image0)
   added: (have_image phenomenon12 image0)
   goals met: 4 of 11
12. (turn_to satellite0 planet15 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet15)
   goals met: 4 of 11
13. (take_image satellite0 planet15 instrument0 image0)
   added: (have_image planet15 image0)
   goals met: 5 of 11
14. (turn_to satellite0 planet17 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet17)
   goals met: 5 of 11
15. (take_image satellite0 planet17 instrument0 infrared1)
   added: (have_image planet17 infrared1)
   goals met: 6 of 11
16. (turn_to satellite0 planet8 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet8)
   goals met: 6 of 11
17. (take_image satellite0 planet8 instrument0 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 7 of 11
18. (turn_to satellite0 star16 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star16)
   goals met: 7 of 11
19. (take_image satellite0 star16 instrument0 infrared1)
   added: (have_image star16 infrared1)
   goals met: 8 of 11
20. (turn_to satellite0 star9 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star9)
   goals met: 8 of 11
21. (take_image satellite0 star9 instrument0 infrared1)
   added: (have_image star9 infrared1)
   goals met: 9 of 11
22. (turn_to satellite0 star13 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star13)
   goals met: 10 of 11
23. (take_image satellite0 star13 instrument0 infrared1)
   added: (have_image star13 infrared1)
   goals met: 11 of 11
